{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-CATEGORIA_EMPRESA",
    "2": "B-NOMBRE_EMPRESA",
    "3": "B-NUM_EMPLEADOS",
    "4": "B-SECTOR",
    "5": "B-VALOR_ACTIVOS",
    "6": "B-VALOR_CARTERA",
    "7": "B-VALOR_DEUDAS",
    "8": "B-VALOR_GANANCIAS",
    "9": "I-CATEGORIA_EMPRESA",
    "10": "I-NOMBRE_EMPRESA",
    "11": "I-NUM_EMPLEADOS",
    "12": "I-SECTOR",
    "13": "I-VALOR_ACTIVOS",
    "14": "I-VALOR_CARTERA",
    "15": "I-VALOR_DEUDAS",
    "16": "I-VALOR_GANANCIAS"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CATEGORIA_EMPRESA": 1,
    "B-NOMBRE_EMPRESA": 2,
    "B-NUM_EMPLEADOS": 3,
    "B-SECTOR": 4,
    "B-VALOR_ACTIVOS": 5,
    "B-VALOR_CARTERA": 6,
    "B-VALOR_DEUDAS": 7,
    "B-VALOR_GANANCIAS": 8,
    "I-CATEGORIA_EMPRESA": 9,
    "I-NOMBRE_EMPRESA": 10,
    "I-NUM_EMPLEADOS": 11,
    "I-SECTOR": 12,
    "I-VALOR_ACTIVOS": 13,
    "I-VALOR_CARTERA": 14,
    "I-VALOR_DEUDAS": 15,
    "I-VALOR_GANANCIAS": 16,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31002
}
